num_month = int(input('Введите номер месяца от 1 до 12: '))
my_list = ['Зима', 'Весна', 'Лето', 'Осень']
if num_month <= 2 or num_month == 12:
    print('Результат через список:  ' + my_list[0])
elif 2 < num_month <= 5:
    print('Результат через список:  ' + my_list[1])
elif 5 < num_month <= 8:
    print('Результат через список:  ' + my_list[2])
elif 8 < num_month <= 11:
    print('Результат через список:  ' + my_list[3])

my_dict = {12: 'Зима', 1: 'Зима', 2: 'Зима', 3: 'Весна', 4: 'Весна', 5: 'Весна', 6: 'Лето', 7: 'Лето', 8: 'Лето',
           9: 'Осень', 10: 'Осень', 11: 'Осень'}

print('Результат через словарь:  ' + my_dict[num_month])
